# Найти НОК двух чисел
import math
num_1 = int(input('введите первое число: '))
num_2 = int(input('введите второе число: '))

print(math.lcm(num_1, num_2))